tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# python
brew "python3"

# rust
brew "rustup"

# node
brew "node"
brew "yarn"

# libraries
brew "boost"

# cli tools
brew "autojump"
brew "direnv"
brew "fasd"
brew "fzf"
brew "git"
brew "gnupg"
brew "htop"
brew "iftop"
brew "ipcalc"
brew "jq"
brew "mariadb"
brew "neovim"
brew "openssl"
brew "ripgrep"
brew "rlwrap"
brew "sift"
brew "wget"
cask "cmake"
cask "docker"

# gui
cask "iterm2"
cask "bitwarden"
cask "signal"
cask "visual-studio-code"
cask "dash"

# window management
tap "koekeishiya/formulae"
brew "koekeishiya/formulae/skhd", restart_service: :changed
brew "koekeishiya/formulae/yabai", restart_service: :changed

# fonts
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"
